OpenNuvoton/M55M1BSP/SampleCode/ISP/ISP_MSC/M55M1_User.h
/**************************************************************************//**
 * @file     M55M1.h
 * @version  V1.00
 * @brief    Peripheral Access Layer Header File for NuMicro M55M1
 *
 * @copyright SPDX-License-Identifier: Apache-2.0
 * @copyright Copyright (C) 2023 Nuvoton Technology Corp. All rights reserved.
 ******************************************************************************/

/**
  \mainpage NuMicro M55M1 Series CMSIS BSP Driver Reference
  *
  * <b>Introduction</b>
  *
  * This user manual describes the usage of M55M1/M55M1 Series MCU device driver
  *
  * <b>Disclaimer</b>
  *
  * The Software is furnished "AS IS", without warranty as to performance or results, and
  * the entire risk as to performance or results is assumed by YOU. Nuvoton disclaims all
  * warranties, express, implied or otherwise, with regard to the Software, its use, or
  * operation, including without limitation any and all warranties of merchantability, fitness
  * for a particular purpose, and non-infringement of intellectual property rights.
  *
  * <b>Important Notice</b>
  *
  * Nuvoton Products are neither intended nor warranted for usage in systems or equipment,
  * any malfunction or failure of which may cause loss of human life, bodily injury or severe
  * property damage. Such applications are deemed, "Insecure Usage".
  *
  * Insecure usage includes, but is not limited to: equipment for surgical implementation,
  * atomic energy control instruments, airplane or spaceship instruments, the control or
  * operation of dynamic, brake or safety systems designed for vehicular use, traffic signal
  * instruments, all types of safety devices, and other applications intended to support or
  * sustain life.
  *
  * All Insecure Usage shall be made at customer's risk, and in the event that third parties
  * lay claims to Nuvoton as a result of customer's Insecure Usage, customer shall indemnify
  * the damages and liabilities thus incurred by Nuvoton.
  *
  * Please note that all data and specifications are subject to change without notice. All the
  * trademarks of products and companies mentioned in this datasheet belong to their respective
  * owners.
  *
  * <b>Copyright Notice</b>
  *
  * SPDX-License-Identifier: Apache-2.0<br/>
  * Copyright (C) 2023 Nuvoton Technology Corp. All rights reserved.
  */


#ifndef __M55M1_H__
#define __M55M1_H__

#ifdef __cplusplus
extern "C" {
#endif

#if !defined(TESTCHIP_ONLY)
/* Notice: The BSP is for M55M1 engineering sample version. */
#define TESTCHIP_ONLY
#endif

#if defined(TESTCHIP_ONLY)
/* Notice: The BSP release is aligned to AF part number by default. */
//#define ALIGN_AF_PINS
#endif

/******************************************************************************/
/*                Processor and Core peripheral                              */
/******************************************************************************/
/** @addtogroup CMSIS_Device Device CMSIS Definitions
    Configuration of the Cortex-M4 Processor and Core peripheral
    @{
*/

/* -------------------  Interrupt Number Definition  ------------------------------ */

typedef enum IRQn
{
    /* -------------------  Processor Exceptions Numbers  ----------------------------- */
    NonMaskableInt_IRQn           = -14,      /*  2 Non Maskable Interrupt                  */
    HardFault_IRQn                = -13,      /*  3 HardFault Interrupt                     */
    MemoryManagement_IRQn         = -12,      /*  4 Memory Management Interrupt             */
    BusFault_IRQn                 = -11,      /*  5 Bus Fault Interrupt                     */
    UsageFault_IRQn               = -10,      /*  6 Usage Fault Interrupt                   */
    SecureFault_IRQn              =  -9,      /*  7 Secure Fault Interrupt                  */
    SVCall_IRQn                   =  -5,      /* 11 SVC Interrupt                           */
    DebugMonitor_IRQn             =  -4,      /* 12 Debug Monitor Interrupt                 */
    PendSV_IRQn                   =  -2,      /* 14 Pend SV Interrupt                       */
    SysTick_IRQn                  =  -1,      /* 15 System Tick Interrupt                   */

    /* -------------------  Processor Interrupt Numbers  ------------------------------ */
    BODOUT_IRQn                   =   0,      /*!< Brown-Out Low Voltage Detected Interrupt */
    IRC_IRQn                      =   1,      /*!< IRC TRIM Interrupt                       */
    PMC_IRQn                      =   2,      /*!< Power Mode Controller Interrupt          */
    SRAMPERR_IRQn                 =   3,      /*!< SRAM Parity Check Error Interrupt        */
    CKFAIL_IRQn                   =   4,      /*!< Clock Fail Detected Interrupt            */
    ISP_IRQn                      =   5,      /*!< FMC ISP Interrupt                        */
    RTC_IRQn                      =   6,      /*!< Real Time Clock Interrupt                */
    RTCTAMPER_IRQn                =   7,      /*!< Backup Register Tamper Interrupt         */
    WDT0_IRQn                     =   8,      /*!< Watchdog Timer 0 Interrupt               */
    WWDT0_IRQn                    =   9,      /*!< Window Watchdog Timer 0 Interrupt        */

    /*!< Reserved                                 */
    WDT1_IRQn                     =  11,      /*!< Watchdog Timer 1 Interrupt               */
    WWDT1_IRQn                    =  12,      /*!< Window Watchdog Timer 1 Interrupt        */
    NPU_IRQn                      =  13,      /*!< Neural Network Processor Interrupt       */
    EINT0_IRQn                    =  14,      /*!< External Input 0 Interrupt               */
    EINT1_IRQn                    =  15,      /*!< External Input 1 Interrupt               */
    EINT2_IRQn                    =  16,      /*!< External Input 2 Interrupt               */
    EINT3_IRQn                    =  17,      /*!< External Input 3 Interrupt               */
    EINT4_IRQn                    =  18,      /*!< External Input 4 Interrupt               */
    EINT5_IRQn                    =  19,      /*!< External Input 5 Interrupt               */

    GPA_IRQn                      =  20,      /*!< GPIO Port A Interrupt                    */
    GPB_IRQn                      =  21,      /*!< GPIO Port B Interrupt                    */
    GPC_IRQn                      =  22,      /*!< GPIO Port C Interrupt                    */
    GPD_IRQn                      =  23,      /*!< GPIO Port D Interrupt                    */
    GPE_IRQn                      =  24,      /*!< GPIO Port E Interrupt                    */
    GPF_IRQn                      =  25,      /*!< GPIO Port F Interrupt                    */
    GPG_IRQn                      =  26,      /*!< GPIO Port G Interrupt                    */
    GPH_IRQn                      =  27,      /*!< GPIO Port H Interrupt                    */
    GPI_IRQn                      =  28,      /*!< GPIO Port I Interrupt                    */
    GPJ_IRQn                      =  29,      /*!< GPIO Port J Interrupt                    */

