OpenNuvoton/M55M1BSP/SampleCode/ISP/ISP_MSC/M55M1_User.h
    /*!< Reserved                                 */
    /*!< Reserved                                 */
    /*!< Reserved                                 */
    /*!< Reserved                                 */
    LPADC0_IRQn                   = 134,      /*!< Low Power ADC 0 Interrupt                */
    // DAC1 is not support in TESTCHIP_ONLY
    DAC01_IRQn                    = 135,      /*!< DAC0 and DAC1 Interrupt                  */
    /*!< Reserved                                 */
    EQEI0_IRQn                    = 137,      /*!< EQEI0 Interrupt                          */
    EQEI1_IRQn                    = 138,      /*!< EQEI1 Interrupt                          */
    EQEI2_IRQn                    = 139,      /*!< EQEI2 Interrupt                          */

    EQEI3_IRQn                    = 140,      /*!< EQEI3 Interrupt                          */
    ECAP0_IRQn                    = 141,      /*!< ECAP0 Interrupt                          */
    ECAP1_IRQn                    = 142,      /*!< ECAP1 Interrupt                          */
    ECAP2_IRQn                    = 143,      /*!< ECAP2 Interrupt                          */
    ECAP3_IRQn                    = 144,      /*!< ECAP3 Interrupt                          */
    /*!< Reserved                                 */
    /*!< Reserved                                 */
    /*!< Reserved                                 */
    /*!< Reserved                                 */
    AWF_IRQn                      = 149,      /*!< AWF Interrupt                            */

    UTCPD_IRQn                    = 150,      /*!< UTCPD Interrupt                          */
    /*!< Reserved                                 */
    /*!< Reserved                                 */
    /*!< Reserved                                 */
    /*!< Reserved                                 */
    /*!< Reserved                                 */
    /*!< Reserved                                 */
    /*!< Reserved                                 */
    /*!< Reserved                                 */
    /*!< Reserved                                 */

    GDMACH0_IRQn                  = 160,      /*!< GDMA Channel 0 Interrupt                 */
    GDMACH1_IRQn                  = 161,      /*!< GDMA Channel 1 Interrupt                 */
    TOTAL_IRQn_CNT                = GDMACH1_IRQn + 16,
} IRQn_Type;


/* ================================================================================ */
/* ================      Processor and Core Peripheral Section     ================ */
/* ================================================================================ */

/* -------  Start of section using anonymous unions and disabling warnings  ------- */
#if   defined (__CC_ARM)
#pragma push
#pragma anon_unions
#elif defined (__ICCARM__)
#pragma language=extended
#elif defined(__AFMCC_VERSION) && (__AFMCC_VERSION >= 6010050)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wc11-extensions"
#pragma clang diagnostic ignored "-Wreserved-id-macro"
#elif defined (__GNUC__)
/* anonymous unions are enabled by default */
#elif defined (__TMS470__)
/* anonymous unions are enabled by default */
#elif defined (__TASKING__)
#pragma warning 586
#elif defined (__CSMC__)
/* anonymous unions are enabled by default */
#else
#warning Not supported compiler type
#endif


/* --------  Configuration of Core peripheral  ----------------------------------- */
#define __CM55_REV                0x0001U     /* Core revision r0p1 */
#define __NVIC_PRIO_BITS          3U          /* Number of Bits used for Priority Levels */
#define __Vendor_SysTickConfig    0U          /* Set to 1 if different SysTick Config is used */
#define __VTOR_PRESENT            1U          /* VTOR present */
#define __MPU_PRESENT             1U          /* MPU present */
#define __FPU_PRESENT             1U          /* FPU present */
#define __FPU_DP                  1U          /* double precision FPU */
#define __DSP_PRESENT             1U          /* DSP extension present */
#define __SAUREGION_PRESENT       1U          /* SAU regions present */
#define __PMU_PRESENT             1U          /* PMU present */
#define __PMU_NUM_EVENTCNT        8U          /* PMU Event Counters */
#define __ICACHE_PRESENT          1U          /* Instruction Cache present */
#define __DCACHE_PRESENT          1U          /* Data Cache present */

/** @} end of group CMSIS_Device */


#include "core_cm55.h"                        /* Processor and core peripheral */
#include "system_M55M1.h"                     /* System header */
#if __has_include("partition_M55M1.h")
#include "partition_M55M1.h"                  /* User defined setup for Secure/Non-Secure Zones */
#else
#include "partition_M55M1_template.h"         /* Default setup for Secure/Non-Secure Zones */
#endif

#if __has_include("mpu_config_M55M1.h")
#include "mpu_config_M55M1.h"                  /* User defined setup for MPU regions */
#else
#include "mpu_config_M55M1_template.h"         /* Default setup for MPU regions */
#endif

/******************************************************************************/
/*                        Peripheral Register Structures                      */
/******************************************************************************/

/** @addtogroup REGISTER Control Register
    @{
*/

#include "acmp_reg.h"
#include "awf_reg.h"
#include "bpwm_reg.h"
#include "canfd_reg.h"
#include "ccap_reg.h"
#include "clk_reg.h"
#include "crc_reg.h"
#include "crypto_reg.h"
#include "dac_reg.h"
#include "dmic_reg.h"
#include "eadc_reg.h"
#include "ebi_reg.h"
#include "ecap_reg.h"
#include "epwm_reg.h"
#include "eqei_reg.h"
#include "fmc_reg.h"
#include "gpio_reg.h"
#include "hsotg_reg.h"
#include "hsusbd_reg.h"
#include "hsusbh_reg.h"
#include "i2c_reg.h"
#include "i2s_reg.h"
#include "i3c_reg.h"
#include "kdf_reg.h"
#include "kpi_reg.h"
#include "ks_reg.h"
#include "lpadc_reg.h"
#include "lpgpio_reg.h"
#include "lpi2c_reg.h"
#include "lppdma_reg.h"
#include "lpspi_reg.h"
#include "lptmr_reg.h"
#include "lpuart_reg.h"
#include "otfc_reg.h"
#include "otg_reg.h"
#include "pdma_reg.h"
#include "pmc_reg.h"
#include "psio_reg.h"
#include "qspi_reg.h"
#include "rtc_reg.h"
#include "sc_reg.h"
#include "scu_reg.h"
#include "sdh_reg.h"
#include "spi_reg.h"
#include "spim_reg.h"
#include "sys_reg.h"
#include "timer_reg.h"
#include "trng_reg.h"
#include "ttmr_reg.h"
#include "uart_reg.h"
#include "utcpd_reg.h"
#include "ui2c_reg.h"
#include "usbd_reg.h"
#include "usbh_reg.h"
#include "uspi_reg.h"
#include "uuart_reg.h"
#include "wdt_reg.h"
#include "wwdt_reg.h"

/** @} end of REGISTER group */


/******************************************************************************/
/*                         Peripheral Memory Map                              */
/******************************************************************************/

