OpenNuvoton/M55M1BSP/SampleCode/ISP/ISP_MSC/M55M1_User.h
#define NPU_NS                                    (NPU_BASE       + NS_OFFSET)
#define OTG_NS                    ((OTG_T *)      (OTG_BASE       + NS_OFFSET))
#define PA_NS                     ((GPIO_T *)     (GPIOA_BASE     + NS_OFFSET))
#define PB_NS                     ((GPIO_T *)     (GPIOB_BASE     + NS_OFFSET))
#define PC_NS                     ((GPIO_T *)     (GPIOC_BASE     + NS_OFFSET))
#define PD_NS                     ((GPIO_T *)     (GPIOD_BASE     + NS_OFFSET))
#define PE_NS                     ((GPIO_T *)     (GPIOE_BASE     + NS_OFFSET))
#define PF_NS                     ((GPIO_T *)     (GPIOF_BASE     + NS_OFFSET))
#define PG_NS                     ((GPIO_T *)     (GPIOG_BASE     + NS_OFFSET))
#define PH_NS                     ((GPIO_T *)     (GPIOH_BASE     + NS_OFFSET))
#define PI_NS                     ((GPIO_T *)     (GPIOI_BASE     + NS_OFFSET))
#define PJ_NS                     ((GPIO_T *)     (GPIOJ_BASE     + NS_OFFSET))
#define PDMA0_NS                  ((PDMA_T *)     (PDMA0_BASE     + NS_OFFSET))
#define PDMA1_NS                  ((PDMA_T *)     (PDMA1_BASE     + NS_OFFSET))
#define PSIO_NS                   ((PSIO_T *)     (PSIO_BASE      + NS_OFFSET))
#define QSPI0_NS                  ((QSPI_T *)     (QSPI0_BASE     + NS_OFFSET))
#define QSPI1_NS                  ((QSPI_T *)     (QSPI1_BASE     + NS_OFFSET))

#define SC0_NS                    ((SC_T *)       (SC0_BASE       + NS_OFFSET))
#define SC1_NS                    ((SC_T *)       (SC1_BASE       + NS_OFFSET))
#define SC2_NS                    ((SC_T *)       (SC2_BASE       + NS_OFFSET))
#define DPM_NS                    ((DPM_T *)      (DPM_BASE       + NS_OFFSET))
#define SDH0_NS                   ((SDH_T *)      (SDH0_BASE      + NS_OFFSET))
#define SDH1_NS                   ((SDH_T *)      (SDH1_BASE      + NS_OFFSET))
#define SPI0_NS                   ((SPI_T *)      (SPI0_BASE      + NS_OFFSET))
#define SPI1_NS                   ((SPI_T *)      (SPI1_BASE      + NS_OFFSET))
#define SPI2_NS                   ((SPI_T *)      (SPI2_BASE      + NS_OFFSET))
#define SPI3_NS                   ((SPI_T *)      (SPI3_BASE      + NS_OFFSET))
#define SPIM0_NS                  ((SPIM_T *)     (SPIM0_BASE     + NS_OFFSET))
#if defined(TESTCHIP_ONLY)
#define SPIM1_NS                  ((SPIM_T *)     (SPIM1_BASE     + NS_OFFSET))
#endif
#define SYS_NS                    ((SYS_T *)      (SYS_BASE       + NS_OFFSET))
#define TIMER0_NS                 ((TIMER_T *)    (TIMER0_BASE    + NS_OFFSET))
#define TIMER1_NS                 ((TIMER_T *)    (TIMER1_BASE    + NS_OFFSET))
#define TIMER2_NS                 ((TIMER_T *)    (TIMER2_BASE    + NS_OFFSET))
#define TIMER3_NS                 ((TIMER_T *)    (TIMER3_BASE    + NS_OFFSET))
#define TRNG_NS                   ((TRNG_T *)     (TRNG_BASE      + NS_OFFSET))
#define TTMR0_NS                  ((TTMR_T *)     (TTMR0_BASE     + NS_OFFSET))
#define TTMR1_NS                  ((TTMR_T *)     (TTMR1_BASE     + NS_OFFSET))
#define UART0_NS                  ((UART_T *)     (UART0_BASE     + NS_OFFSET))
#define UART1_NS                  ((UART_T *)     (UART1_BASE     + NS_OFFSET))
#define UART2_NS                  ((UART_T *)     (UART2_BASE     + NS_OFFSET))
#define UART3_NS                  ((UART_T *)     (UART3_BASE     + NS_OFFSET))
#define UART4_NS                  ((UART_T *)     (UART4_BASE     + NS_OFFSET))
#define UART5_NS                  ((UART_T *)     (UART5_BASE     + NS_OFFSET))
#define UART6_NS                  ((UART_T *)     (UART6_BASE     + NS_OFFSET))
#define UART7_NS                  ((UART_T *)     (UART7_BASE     + NS_OFFSET))
#define UART8_NS                  ((UART_T *)     (UART8_BASE     + NS_OFFSET))
#define UART9_NS                  ((UART_T *)     (UART9_BASE     + NS_OFFSET))
#define USBH0_NS                  ((USBH_T *)     (USBH0_BASE     + NS_OFFSET))
#define USBH1_NS                  ((USBH1_T *)    (USBH1_BASE     + NS_OFFSET))
#define USBD_NS                   ((USBD_T *)     (USBD_BASE      + NS_OFFSET))
#define UI2C0_NS                  ((UI2C_T *)     (USCI0_BASE     + NS_OFFSET))
#define USPI0_NS                  ((USPI_T *)     (USCI0_BASE     + NS_OFFSET))
#define UTCPD_NS                  ((UTCPD_T *)    (UTCPD_BASE     + NS_OFFSET))
#define UUART0_NS                 ((UUART_T *)    (USCI0_BASE     + NS_OFFSET))
#define VAD0_NS                   ((VAD_T *)      (VAD0_BASE      + NS_OFFSET))
#define WDT1_NS                   ((WDT_T *)      (WDT1_BASE      + NS_OFFSET))
#define WWDT0_NS                  ((WWDT_T *)     (WWDT0_BASE     + NS_OFFSET))
#define WWDT1_NS                  ((WWDT_T *)     (WWDT1_BASE     + NS_OFFSET))

/** @} end of group PERIPHERAL_NS */

/** @addtogroup PERIPHERAL_SNS Peripheral Pointer
    The Declaration of Peripheral Pointer
    @{
*/

# define PA       ((__PC() & NS_OFFSET) ? PA_NS : PA_S)
# define PB       ((__PC() & NS_OFFSET) ? PB_NS : PB_S)
# define PC       ((__PC() & NS_OFFSET) ? PC_NS : PC_S)
# define PD       ((__PC() & NS_OFFSET) ? PD_NS : PD_S)
# define PE       ((__PC() & NS_OFFSET) ? PE_NS : PE_S)
# define PF       ((__PC() & NS_OFFSET) ? PF_NS : PF_S)
# define PG       ((__PC() & NS_OFFSET) ? PG_NS : PG_S)
# define PH       ((__PC() & NS_OFFSET) ? PH_NS : PH_S)
# define PI       ((__PC() & NS_OFFSET) ? PI_NS : PI_S)
# define PJ       ((__PC() & NS_OFFSET) ? PJ_NS : PJ_S)

/* Always Secure peripheral */
#define CLK       CLK_S
#define DPM       DPM_S
/*#define FVC       FVC_S*/ /* TESTCHIP_ONLY not support */
#define FMC       FMC_S
#define GPIO      GPIO_S
#define KS        KS_S
#define OTFC0     OTFC0_S
#if defined(TESTCHIP_ONLY)
#define OTFC1     OTFC1_S
#endif
#define PLM       PLM_S
#define PMC       PMC_S
#define SCU       SCU_S
#define SYS       SYS_S
#define WDT0      WDT0_S

/* Always Non-Secure peripheral */
#define WDT1      WDT1_NS

/* SCU Configured peripheral */
/* SCU_D0PNS0 */
#if defined (SCU_INIT_D0PNS0_VAL) && (SCU_INIT_D0PNS0_VAL & SCU_D0PNS0_NPU_Msk)
#define NPU          NPU_NS
#else
#define NPU          NPU_S
#endif

/* SCU_D0PNS2 */
#if defined (SCU_INIT_D0PNS2_VAL) && (SCU_INIT_D0PNS2_VAL & SCU_D0PNS2_SPIM0_Msk)
#define SPIM0        SPIM0_NS
#else
#define SPIM0        SPIM0_S
#endif

#if defined(TESTCHIP_ONLY)
#if defined (SCU_INIT_D0PNS2_VAL) && (SCU_INIT_D0PNS2_VAL & SCU_D0PNS2_SPIM1_Msk)
#define SPIM1        SPIM1_NS
#else
#define SPIM1        SPIM1_S
#endif
#endif

/* SCU_D1PNS0 */
#if defined (SCU_INIT_D1PNS0_VAL) && (SCU_INIT_D1PNS0_VAL & SCU_D1PNS0_PDMA0_Msk)
#define PDMA0        PDMA0_NS
#else
#define PDMA0        PDMA0_S
#endif

#if defined (SCU_INIT_D1PNS0_VAL) && (SCU_INIT_D1PNS0_VAL & SCU_D1PNS0_PDMA1_Msk)
#define PDMA1        PDMA1_NS
#else
#define PDMA1        PDMA1_S
#endif

#if defined (SCU_INIT_D1PNS0_VAL) && (SCU_INIT_D1PNS0_VAL & SCU_D1PNS0_USBH0_Msk)
#define USBH0        USBH0_NS
#else
#define USBH0        USBH0_S
#endif

