OpenNuvoton/M55M1BSP/SampleCode/ISP/ISP_MSC/M55M1_User.h
/** @addtogroup IO_ROUTINE I/O Routines
    The Declaration of I/O Routines
    @{
 */

typedef volatile uint8_t  vu8;    ///< Define  8-bit unsigned volatile data type
typedef volatile uint16_t vu16;   ///< Define 16-bit unsigned volatile data type
typedef volatile uint32_t vu32;   ///< Define 32-bit unsigned volatile data type
typedef volatile uint64_t vu64;   ///< Define 64-bit unsigned volatile data type

/**
  * @brief Get a 8-bit unsigned value from specified address
  * @param[in] addr Address to get 8-bit data from
  * @return  8-bit unsigned value stored in specified address
  */
#define M8(addr)            (*((vu8  *) (addr)))

/**
  * @brief Get a 16-bit unsigned value from specified address
  * @param[in] addr Address to get 16-bit data from
  * @return  16-bit unsigned value stored in specified address
  * @note The input address must be 16-bit aligned
  */
#define M16(addr)           (*((vu16 *) (addr)))

/**
  * @brief Get a 32-bit unsigned value from specified address
  * @param[in] addr Address to get 32-bit data from
  * @return  32-bit unsigned value stored in specified address
  * @note The input address must be 32-bit aligned
  */
#define M32(addr)           (*((vu32 *) (addr)))

/**
  * @brief Set a 32-bit unsigned value to specified I/O port
  * @param[in] port Port address to set 32-bit data
  * @param[in] value Value to write to I/O port
  * @return  None
  * @note The output port must be 32-bit aligned
  */
#define outpw(port,value)   (*((volatile unsigned int *)(port))=(value))

/**
  * @brief Get a 32-bit unsigned value from specified I/O port
  * @param[in] port Port address to get 32-bit data from
  * @return  32-bit unsigned value stored in specified I/O port
  * @note The input port must be 32-bit aligned
  */
#define inpw(port)          ((*((volatile unsigned int *)(port))))

/**
  * @brief Set a 16-bit unsigned value to specified I/O port
  * @param[in] port Port address to set 16-bit data
  * @param[in] value Value to write to I/O port
  * @return  None
  * @note The output port must be 16-bit aligned
  */
#define outps(port,value)   (*((volatile unsigned short *)(port))=(value))

/**
  * @brief Get a 16-bit unsigned value from specified I/O port
  * @param[in] port Port address to get 16-bit data from
  * @return  16-bit unsigned value stored in specified I/O port
  * @note The input port must be 16-bit aligned
  */
#define inps(port)          ((*((volatile unsigned short *)(port))))

/**
  * @brief Set a 8-bit unsigned value to specified I/O port
  * @param[in] port Port address to set 8-bit data
  * @param[in] value Value to write to I/O port
  * @return  None
  */
#define outpb(port,value)   (*((volatile unsigned char *)(port))=(value))

/**
  * @brief Get a 8-bit unsigned value from specified I/O port
  * @param[in] port Port address to get 8-bit data from
  * @return  8-bit unsigned value stored in specified I/O port
  */
#define inpb(port)          ((*((volatile unsigned char *)(port))))

/**
  * @brief Set a 32-bit unsigned value to specified I/O port
  * @param[in] port Port address to set 32-bit data
  * @param[in] value Value to write to I/O port
  * @return  None
  * @note The output port must be 32-bit aligned
  */
#define outp32(port,value)  (*((volatile unsigned int *)(port))=(value))

/**
  * @brief Get a 32-bit unsigned value from specified I/O port
  * @param[in] port Port address to get 32-bit data from
  * @return  32-bit unsigned value stored in specified I/O port
  * @note The input port must be 32-bit aligned
  */
#define inp32(port)         ((*((volatile unsigned int *)(port))))

/**
  * @brief Set a 16-bit unsigned value to specified I/O port
  * @param[in] port Port address to set 16-bit data
  * @param[in] value Value to write to I/O port
  * @return  None
  * @note The output port must be 16-bit aligned
  */
#define outp16(port,value)  (*((volatile unsigned short *)(port))=(value))

/**
  * @brief Get a 16-bit unsigned value from specified I/O port
  * @param[in] port Port address to get 16-bit data from
  * @return  16-bit unsigned value stored in specified I/O port
  * @note The input port must be 16-bit aligned
  */
#define inp16(port)         ((*((volatile unsigned short *)(port))))

/**
  * @brief Set a 8-bit unsigned value to specified I/O port
  * @param[in] port Port address to set 8-bit data
  * @param[in] value Value to write to I/O port
  * @return  None
  */
#define outp8(port,value)   (*((volatile unsigned char *)(port))=(value))

/**
  * @brief Get a 8-bit unsigned value from specified I/O port
  * @param[in] port Port address to get 8-bit data from
  * @return  8-bit unsigned value stored in specified I/O port
  */
#define inp8(port)          ((*((volatile unsigned char *)(port))))

/** @} end of group IO_ROUTINE */


/******************************************************************************/
/*                Legacy Constants                                            */
/******************************************************************************/

/** @addtogroup Legacy_Constants Legacy Constants
    Legacy Constants
    @{
*/

#define E_SUCCESS           (0)

#ifndef NULL
#define NULL                (0)                 ///< NULL pointer
#endif

#define TRUE                (1UL)               ///< Boolean true, define to use in API parameters or return value
#define FALSE               (0UL)               ///< Boolean false, define to use in API parameters or return value

#define ENABLE              (1UL)               ///< Enable, define to use in API parameters
#define DISABLE             (0UL)               ///< Disable, define to use in API parameters

/* Define one bit mask */
#define BIT0                (0x00000001UL)      ///< Bit 0 mask of an 32 bit integer
#define BIT1                (0x00000002UL)      ///< Bit 1 mask of an 32 bit integer
#define BIT2                (0x00000004UL)      ///< Bit 2 mask of an 32 bit integer
#define BIT3                (0x00000008UL)      ///< Bit 3 mask of an 32 bit integer
#define BIT4                (0x00000010UL)      ///< Bit 4 mask of an 32 bit integer
#define BIT5                (0x00000020UL)      ///< Bit 5 mask of an 32 bit integer
#define BIT6                (0x00000040UL)      ///< Bit 6 mask of an 32 bit integer
#define BIT7                (0x00000080UL)      ///< Bit 7 mask of an 32 bit integer
#define BIT8                (0x00000100UL)      ///< Bit 8 mask of an 32 bit integer
#define BIT9                (0x00000200UL)      ///< Bit 9 mask of an 32 bit integer
#define BIT10               (0x00000400UL)      ///< Bit 10 mask of an 32 bit integer
#define BIT11               (0x00000800UL)      ///< Bit 11 mask of an 32 bit integer
#define BIT12               (0x00001000UL)      ///< Bit 12 mask of an 32 bit integer
#define BIT13               (0x00002000UL)      ///< Bit 13 mask of an 32 bit integer
#define BIT14               (0x00004000UL)      ///< Bit 14 mask of an 32 bit integer
#define BIT15               (0x00008000UL)      ///< Bit 15 mask of an 32 bit integer
#define BIT16               (0x00010000UL)      ///< Bit 16 mask of an 32 bit integer
#define BIT17               (0x00020000UL)      ///< Bit 17 mask of an 32 bit integer
#define BIT18               (0x00040000UL)      ///< Bit 18 mask of an 32 bit integer
#define BIT19               (0x00080000UL)      ///< Bit 19 mask of an 32 bit integer
#define BIT20               (0x00100000UL)      ///< Bit 20 mask of an 32 bit integer
#define BIT21               (0x00200000UL)      ///< Bit 21 mask of an 32 bit integer
#define BIT22               (0x00400000UL)      ///< Bit 22 mask of an 32 bit integer
#define BIT23               (0x00800000UL)      ///< Bit 23 mask of an 32 bit integer
#define BIT24               (0x01000000UL)      ///< Bit 24 mask of an 32 bit integer
#define BIT25               (0x02000000UL)      ///< Bit 25 mask of an 32 bit integer
#define BIT26               (0x04000000UL)      ///< Bit 26 mask of an 32 bit integer
#define BIT27               (0x08000000UL)      ///< Bit 27 mask of an 32 bit integer
#define BIT28               (0x10000000UL)      ///< Bit 28 mask of an 32 bit integer
#define BIT29               (0x20000000UL)      ///< Bit 29 mask of an 32 bit integer
#define BIT30               (0x40000000UL)      ///< Bit 30 mask of an 32 bit integer
#define BIT31               (0x80000000UL)      ///< Bit 31 mask of an 32 bit integer

/* Byte Mask Definitions */
#define BYTE0_Msk           (0x000000FFUL)      ///< Mask to get bit0~bit7 from a 32 bit integer
#define BYTE1_Msk           (0x0000FF00UL)      ///< Mask to get bit8~bit15 from a 32 bit integer
#define BYTE2_Msk           (0x00FF0000UL)      ///< Mask to get bit16~bit23 from a 32 bit integer
#define BYTE3_Msk           (0xFF000000UL)      ///< Mask to get bit24~bit31 from a 32 bit integer

#define GET_BYTE0(u32Param) (((u32Param) & BYTE0_Msk)      )  /*!< Extract Byte 0 (Bit  0~ 7) from parameter u32Param */
#define GET_BYTE1(u32Param) (((u32Param) & BYTE1_Msk) >>  8)  /*!< Extract Byte 1 (Bit  8~15) from parameter u32Param */
#define GET_BYTE2(u32Param) (((u32Param) & BYTE2_Msk) >> 16)  /*!< Extract Byte 2 (Bit 16~23) from parameter u32Param */
#define GET_BYTE3(u32Param) (((u32Param) & BYTE3_Msk) >> 24)  /*!< Extract Byte 3 (Bit 24~31) from parameter u32Param */

/** @} end of group Legacy_Constants */


/******************************************************************************/
/*                         Peripheral header files                            */
/******************************************************************************/

#include "acmp.h"
#include "awf.h"
#include "bpwm.h"
#include "canfd.h"
#include "ccap.h"
#include "clk.h"
#include "crc.h"
#include "dac.h"
#include "dmic.h"
#include "eadc.h"
#include "ebi.h"
#include "ecap.h"
#include "epwm.h"
#include "eqei.h"
#include "fmc.h"
#include "gdma/dma350_lib.h"
#include "gdma/dma350_drv.h"
#include "gpio.h"
#include "hsotg.h"
#include "hsusbd.h"
#include "i2c.h"
#include "i2s.h"
#include "i3c.h"
#include "ks.h"
#include "kdf.h"
#include "crypto.h"
#include "kpi.h"
#include "lpadc.h"
#include "lpgpio.h"
#include "lpi2c.h"
#include "lppdma.h"
#include "lpspi.h"
#include "lptmr.h"
#include "lptmr_pwm.h"
#include "lpuart.h"
#include "otfc.h"
#include "otg.h"
#include "pdma.h"
#include "pmc.h"
#include "psio.h"
#include "qspi.h"
#include "rng.h"
#include "rtc.h"
#include "sc.h"
#include "scu/scu.h"
#include "scu/dpm.h"
#include "scu/plm.h"
#include "scu/mpc_sie_reg_map.h"
#include "scu/mpc_sie_drv.h"
#include "scuart.h"
#include "sdh.h"
#include "spi.h"
#include "spim.h"
#include "spim_hyper.h"
#include "sys.h"
#include "timer.h"
#include "timer_pwm.h"
#include "trng.h"
#include "ttmr.h"
#include "uart.h"
//#include "usbd.h"
#include "usbd_User.h"
#include "usci_i2c.h"
#include "usci_spi.h"
#include "usci_uart.h"
#include "wdt.h"
#include "wwdt.h"


#ifdef __cplusplus
}
#endif

#endif  /* __M55M1_H__ */
